#+Title emacs 

** 运行代码块c-c c-c

用 C-c C-c 运行当前代码块并将它们的结果插入 Org 缓冲区中。默认情况下，运行功能只对 emacs-lisp 代码块开启，但支持多种语言。所支持语言的完整列表见手册。下面是一个代码块和它的结果。

#+begin_src emacs-lisp
  (+ 1 2 3 4)
#+end_src

#+results:
: 10


*** TODO 基本安装教程[/]
:LOGBOOK:  
CLOCK: [2019-05-05 日 10:03]--[2019-05-05 日 10:05] =>  0:02
:END:      

方案：emacs + textlive + auctex + sumatrapdf
按照[[https://blog.csdn.net/engreal/article/details/80704755][此博客]] 安装
更新源 报错
  (running on Debian, switching to user mode!)
  Cannot determine type of tlpdb from /home/work/texmf!
  cannot setup TLPDB in /home/work/texmf at /usr/bin/tlmgr line 6513.
 不想管这个问题了，过于麻烦，没什么用
sudo equivs-build texlive-local报错
  dh_testdir
  dh_testroot
  dh_prep
  dh_testdir
  dh_testroot
  dh_install
  dh_installdocs
  dh_installchangelogs
  dh_installchangelogs: 警告:     debian/changelog(l1): 格式损坏的头行
  LINE: <package name; defaults to equivs-dummy> (1.0) unstable; urgency=low
  dh_installchangelogs: 警告:     debian/changelog(l2): 在预想的 first heading 中发现空行
  dh_installchangelogs: 警告:     debian/changelog(l3): 在预想的 first heading 处发现更改的数据
  LINE:   * First version
  dh_installchangelogs: 警告: 未知信息 ''在输入 更新日志的已分析版本 中
  Can't locate object method "is_valid" via package "unknown" (perhaps you forgot to 
load "unknown"?) at /usr/share/perl5/Debian/Debhelper/Dh_Lib.pm line 1016.
  make: *** [debian/rules:24：binary-indep] 错误 255
  Error in the build process: exit status 2

*** TODO 基本安装教程[/]
:LOGBOOK:  
CLOCK: [2019-05-05 日 10:03]--[2019-05-05 日 10:05] =>  0:02
:END:      

方案：emacs + textlive + auctex + sumatrapdf
按照[[https://blog.csdn.net/engreal/article/details/80704755][此博客]] 安装
更新源 报错
  (running on Debian, switching to user mode!)
  Cannot determine type of tlpdb from /home/work/texmf!
  cannot setup TLPDB in /home/work/texmf at /usr/bin/tlmgr line 6513.
 不想管这个问题了，过于麻烦，没什么用
sudo equivs-build texlive-local报错
  dh_testdir
  dh_testroot
  dh_prep
  dh_testdir
  dh_testroot
  dh_install
  dh_installdocs
  dh_installchangelogs
  dh_installchangelogs: 警告:     debian/changelog(l1): 格式损坏的头行
  LINE: |<|package name; defaults to equivs-dummy> (1.0) unstable; urgency=low
  dh_installchangelogs: 警告:     debian/changelog(l2): 在预想的 first heading 中发现空行
  dh_installchangelogs: 警告:     debian/changelog(l3): 在预想的 first heading 处发现更改的数据
  LINE:   * First version
  dh_installchangelogs: 警告: 未知信息 ''在输入 更新日志的已分析版本 中
  Can't locate object method "is_valid" via package "unknown" (perhaps you forgot to 
load "unknown"?) at /usr/share/perl5/Debian/Debhelper/Dh_Lib.pm line 1016.
  make: *** [debian/rules:24：binary-indep] 错误 255
  Error in the build process: exit status 2

